#ifndef ARCHBIRD_INTERNAL_H
#define ARCHBIRD_INTERNAL_H

#include <archbird/archbird.h>

#include <stdarg.h>

#ifndef ARCHBIRD_IMPLEMENTATION_SHA256
#define ARCHBIRD_IMPLEMENTATION_SHA256                                         \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#ifndef ARCHBIRD_LEXICAL_C_IMPLEMENTATION_SHA256
#define ARCHBIRD_LEXICAL_C_IMPLEMENTATION_SHA256                               \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#ifndef ARCHBIRD_LEXICAL_JAVASCRIPT_IMPLEMENTATION_SHA256
#define ARCHBIRD_LEXICAL_JAVASCRIPT_IMPLEMENTATION_SHA256                      \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#ifndef ARCHBIRD_LEXICAL_PYTHON_IMPLEMENTATION_SHA256
#define ARCHBIRD_LEXICAL_PYTHON_IMPLEMENTATION_SHA256                          \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#ifndef ARCHBIRD_LEXICAL_R_IMPLEMENTATION_SHA256
#define ARCHBIRD_LEXICAL_R_IMPLEMENTATION_SHA256                               \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#ifndef ARCHBIRD_SCIP_IMPLEMENTATION_SHA256
#define ARCHBIRD_SCIP_IMPLEMENTATION_SHA256                                    \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#ifndef ARCHBIRD_VERSION
#define ARCHBIRD_VERSION "0.0.1"
#endif

#define ARCHBIRD_MAP_SCHEMA_MIN 4u
#define ARCHBIRD_MAP_SCHEMA_CURRENT 7u
#define ARCHBIRD_MAP_SCHEMA_CURRENT_TEXT "7"
#define ARCHBIRD_MAP_SCHEMA_SUPPORTED_TEXT "4, 5, 6, or 7"
#ifdef ARCHBIRD_HAVE_TREE_SITTER_C
#ifndef ARCHBIRD_TREE_SITTER_C_IMPLEMENTATION_SHA256
#define ARCHBIRD_TREE_SITTER_C_IMPLEMENTATION_SHA256                           \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_CPP
#ifndef ARCHBIRD_TREE_SITTER_CPP_IMPLEMENTATION_SHA256
#define ARCHBIRD_TREE_SITTER_CPP_IMPLEMENTATION_SHA256                         \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_PYTHON
#ifndef ARCHBIRD_TREE_SITTER_PYTHON_IMPLEMENTATION_SHA256
#define ARCHBIRD_TREE_SITTER_PYTHON_IMPLEMENTATION_SHA256                      \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_JAVASCRIPT
#ifndef ARCHBIRD_TREE_SITTER_JAVASCRIPT_IMPLEMENTATION_SHA256
#define ARCHBIRD_TREE_SITTER_JAVASCRIPT_IMPLEMENTATION_SHA256                  \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_TYPESCRIPT
#ifndef ARCHBIRD_TREE_SITTER_TYPESCRIPT_IMPLEMENTATION_SHA256
#define ARCHBIRD_TREE_SITTER_TYPESCRIPT_IMPLEMENTATION_SHA256                  \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_TSX
#ifndef ARCHBIRD_TREE_SITTER_TSX_IMPLEMENTATION_SHA256
#define ARCHBIRD_TREE_SITTER_TSX_IMPLEMENTATION_SHA256                         \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_R
#ifndef ARCHBIRD_TREE_SITTER_R_IMPLEMENTATION_SHA256
#define ARCHBIRD_TREE_SITTER_R_IMPLEMENTATION_SHA256                           \
  "0000000000000000000000000000000000000000000000000000000000000000"
#endif
#endif

_Static_assert(sizeof(ARCHBIRD_IMPLEMENTATION_SHA256) == 65,
               "ARCHBIRD_IMPLEMENTATION_SHA256 must contain 64 characters");
_Static_assert(
    sizeof(ARCHBIRD_LEXICAL_C_IMPLEMENTATION_SHA256) == 65,
    "ARCHBIRD_LEXICAL_C_IMPLEMENTATION_SHA256 must contain 64 characters");
_Static_assert(sizeof(ARCHBIRD_LEXICAL_JAVASCRIPT_IMPLEMENTATION_SHA256) == 65,
               "ARCHBIRD_LEXICAL_JAVASCRIPT_IMPLEMENTATION_SHA256 must "
               "contain 64 characters");
_Static_assert(sizeof(ARCHBIRD_LEXICAL_PYTHON_IMPLEMENTATION_SHA256) == 65,
               "ARCHBIRD_LEXICAL_PYTHON_IMPLEMENTATION_SHA256 must contain 64 "
               "characters");
_Static_assert(
    sizeof(ARCHBIRD_LEXICAL_R_IMPLEMENTATION_SHA256) == 65,
    "ARCHBIRD_LEXICAL_R_IMPLEMENTATION_SHA256 must contain 64 characters");
_Static_assert(sizeof(ARCHBIRD_SCIP_IMPLEMENTATION_SHA256) == 65,
               "ARCHBIRD_SCIP_IMPLEMENTATION_SHA256 must contain 64 "
               "characters");
#ifdef ARCHBIRD_HAVE_TREE_SITTER_C
_Static_assert(
    sizeof(ARCHBIRD_TREE_SITTER_C_IMPLEMENTATION_SHA256) == 65,
    "ARCHBIRD_TREE_SITTER_C_IMPLEMENTATION_SHA256 must contain 64 characters");
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_CPP
_Static_assert(sizeof(ARCHBIRD_TREE_SITTER_CPP_IMPLEMENTATION_SHA256) == 65,
               "ARCHBIRD_TREE_SITTER_CPP_IMPLEMENTATION_SHA256 must contain 64 "
               "characters");
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_PYTHON
_Static_assert(sizeof(ARCHBIRD_TREE_SITTER_PYTHON_IMPLEMENTATION_SHA256) == 65,
               "ARCHBIRD_TREE_SITTER_PYTHON_IMPLEMENTATION_SHA256 must contain "
               "64 characters");
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_JAVASCRIPT
_Static_assert(sizeof(ARCHBIRD_TREE_SITTER_JAVASCRIPT_IMPLEMENTATION_SHA256) ==
                   65,
               "ARCHBIRD_TREE_SITTER_JAVASCRIPT_IMPLEMENTATION_SHA256 must "
               "contain 64 characters");
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_TYPESCRIPT
_Static_assert(sizeof(ARCHBIRD_TREE_SITTER_TYPESCRIPT_IMPLEMENTATION_SHA256) ==
                   65,
               "ARCHBIRD_TREE_SITTER_TYPESCRIPT_IMPLEMENTATION_SHA256 must "
               "contain 64 characters");
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_TSX
_Static_assert(sizeof(ARCHBIRD_TREE_SITTER_TSX_IMPLEMENTATION_SHA256) == 65,
               "ARCHBIRD_TREE_SITTER_TSX_IMPLEMENTATION_SHA256 must contain 64 "
               "characters");
#endif
#ifdef ARCHBIRD_HAVE_TREE_SITTER_R
_Static_assert(
    sizeof(ARCHBIRD_TREE_SITTER_R_IMPLEMENTATION_SHA256) == 65,
    "ARCHBIRD_TREE_SITTER_R_IMPLEMENTATION_SHA256 must contain 64 characters");
#endif

#define ARCHBIRD_ERROR_CAPACITY 512

struct ArchbirdEngine {
  ArchbirdEngineOptions options;
  ArchbirdStatus error_status;
  size_t error_offset;
  char error[ARCHBIRD_ERROR_CAPACITY];
};

void *ab_malloc(ArchbirdEngine *engine, size_t size);
void *ab_calloc(ArchbirdEngine *engine, size_t count, size_t size);
void *ab_realloc(ArchbirdEngine *engine, void *pointer, size_t size);
void ab_free(ArchbirdEngine *engine, void *pointer);

void archbird_error_clear(ArchbirdEngine *engine);

ArchbirdStatus archbird_error_set(ArchbirdEngine *engine, ArchbirdStatus status,
                                  size_t offset, const char *format, ...);

int ab_sha256_literal_valid(const char *value);
ArchbirdStatus ab_build_identity_validate(ArchbirdEngine *engine);

#endif
